[
  {
    "title": "Egg Tart",
    "imageResource": "egg_tart",
    "time": "1 hr 30 min",
    "calories": "210 calories / serving",
    "rating": "5 / 5",
    "about": "One of the most famous Chinese desserts is the classic egg tart, a delicious pastry consisting of a flaky outer shell with a creamy, but firm egg custard in the center. The origin of this traditional Chinese dessert is vague.",
    "ingredients": [
      "Custard Filling:",
      "4 eggs (reserve 2 tablespoons for pastry dough)",
      "180 mL hot water",
      "6 tablespoons (~75 g) sugar",
      "⅛ teaspoon salt",
      "60 mL evaporated milk",
      "A dash of vanilla extract (optional)",
      "",
      "Pastry Dough:",
      "200 g cake flour (plus extra for dusting)",
      "115 g unsalted butter (at room temperature)",
      "40 g powdered sugar",
      "2 tablespoons beaten egg (from the custard filling eggs)",
      "⅛ teaspoon salt",
      "A dash of vanilla extract (optional)"
    ],
    "recipeInstructions": "For the pastry, in a large bowl, sift flour, sugar, and salt. Then add softened butter. Bring the mixture together with your hands, careful not to knead the pastry dough too much or you will make the pastry tough. \n Whisk the egg yolks and add the 2 tablespoons of beaten yolk to the flour mixture. Bring together until smooth. If the dough is too sticky, coating your hands with flour will help. Cover with plastic wrap and then refrigerate for 30 minutes, or until the dough is firm. \n To make the custard filling, melt sugar and salt with hot water. Mix until dissolved then let cool. \n Add the rest of the beaten egg yolk. Stir in sugar water and also evaporated milk (if adding vanilla, add now). Stir and combine everything well. \n Strain the filling to ensure no lumps. Chill in the refrigerator. \n Preheat the oven to 400˚F (200˚C). \n Take the dough out and divide into 16 equal portions. Spray the tart pan with a light coating of oil. Take one portion of your dough and roll it into a ball and place in your tart shell. Press the shell into the pan with your fingers. Try to make the wrapper uniform in thickness and avoid a thick bottom. Repeat to finish all. \n Pour the custard filling into the shells until it is about 80% full. Bake for 15 to 20 minutes until the surface becomes golden brown and a toothpick can stand in the egg tart. \n Cool down for several minutes and then take the egg tarts out of the pan. Serve while still warm."
  },
  {
    "title": "Croissants",
    "imageResource": "croissant",
    "time": "24 hours",
    "calories": "350 calories / serving (estimate)",
    "rating": "5 / 5",
    "about": "Croissants are a classic French pastry known for their buttery, flaky layers. Making croissants at home requires patience and technique but results in bakery-quality treats with a rich flavor and light texture.",
    "ingredients": [
      "For the Détrempe (dough):",
      "4⅔ cups/605 grams all-purpose or bread flour, plus more for dusting",
      "⅓ cup/66 grams granulated sugar",
      "1 tablespoon plus ½ teaspoon/12 grams kosher salt",
      "2¼ teaspoons/7 grams active dry yeast",
      "¾ cup plus 2 tablespoons/214 grams water, at room temperature",
      "½ cup/120 grams whole milk, at room temperature",
      "¼ cup/57 grams unsalted butter, cut into ½-inch pieces, chilled",
      "",
      "For the Butter Block and Assembly:",
      "1½ cups/340 grams unsalted European or European-style butter (3 sticks), chilled",
      "All-purpose flour, for rolling",
      "1 large egg yolk",
      "1 tablespoon heavy cream"
    ],
    "recipeInstructions": "In a stand mixer, combine flour, sugar, salt, and yeast. Add water and milk, mixing to form a dough. Rest for 10 minutes. \n Add butter to the dough, mixing until smooth and elastic, about 8-10 minutes. Let rise for 45 minutes to 1 hour, then refrigerate for at least 4 hours. \nMake the butter block by flattening cold butter into an 8-inch square between parchment paper. Chill until needed. \nRoll the dough into an 8-inch square. Freeze for 20 minutes. \n Enclose the butter block in the dough, roll out to 24 inches long, and perform a double turn (book fold). Freeze for 15 minutes, then refrigerate for 1 hour. \n Roll the dough again, perform a single turn (letter fold), freeze for 15 minutes, and refrigerate for 1 hour. \nRoll out to 14 by 17 inches, trim, and cut into triangles. Shape each triangle into a croissant. \n Proof in a warm, humid environment for 2-2½ hours. \nPreheat the oven to 375°F. Brush croissants with egg wash, bake for 20 minutes, rotate sheets, then bake for an additional 10-15 minutes until deeply golden. Cool before serving."
  },
  {
    "title": "Matcha Tiramisu",
    "imageResource": "matcha_tiramisu",
    "time": "4 hr 45 min",
    "calories": "300 calories / serving (estimate)",
    "rating": "5 / 5",
    "about": "A twist on a classic tiramisu dessert with creamy matcha mascarpone cream and soft, spongey ladyfingers soaked in matcha for plenty of amazing green tea flavour.",
    "ingredients": [
      "Matcha Mascarpone Cream:",
      "3 large egg yolks",
      "70 g granulated sugar",
      "225 g mascarpone cheese, room temperature",
      "350 g whipping cream",
      "2 teaspoons matcha powder, sifted",
      "1 teaspoon vanilla extract",
      "",
      "Matcha Soak:",
      "2 teaspoons matcha powder, sifted",
      "1 tablespoon granulated sugar",
      "120 g hot water",
      "24-30 ladyfingers",
      "",
      "Topping:",
      "2 teaspoons matcha powder"
    ],
    "recipeInstructions": "Matcha Mascarpone Cream: Fill a pot with about 1 inch of water and bring it to a boil. In a large mixing bowl that fits into the pot without touching the water, whisk together the egg yolks and granulated sugar. \n When the water starts boiling, turn off the heat and place the bowl on top of the pot to create a double boiler. Continuously whisk the egg mixture until the sugar dissolves and it becomes pale in color, about 5 minutes. \n Remove the bowl from the pot and immediately add in the softened mascarpone cheese. Whisk together until smooth and silky. Set aside. \n In a separate mixing bowl, add the whipping cream, matcha powder, and vanilla extract. Use an electric hand mixer with a whisk attachment to whip the cream until it reaches medium peaks. It should have structure and leave trails but still be fluid and not completely stiff. \n Add the whipped cream to the mascarpone mixture and fold together with a spatula until no streaks remain. Set aside. \n Matcha Soak: In a shallow bowl, combine matcha powder, granulated sugar, and hot water. Use a matcha whisk, milk frother, or regular whisk to whisk until slightly frothy, about 30 seconds. \n Very briefly dip a ladyfinger in the matcha soak just enough to coat both sides. Let any excess drip off. Do NOT let it sit in the liquid or soak all the way through or it will quickly turn into mush. Place the ladyfinger in the bottom of a serving container. Repeat until you have a flat, even layer of ladyfingers. \n Add a generous layer of mascarpone cream on top of the ladyfingers and use a spatula to smooth it evenly. \n Repeat with another layer of soaked ladyfingers and another layer of mascarpone cream. \n Cover and chill your matcha tiramisu in the fridge for at least 4 hours or overnight to allow the cream to firm up and ladyfingers to soften. \n Topping: Right before serving, sprinkle the top of your tiramisu with matcha powder."
  },
  {
    "title": "Panna Cotta",
    "imageResource": "panna_cotta",
    "time": "4 hr 35 min",
    "calories": "380 calories / serving (estimate)",
    "rating": "4.8 / 5",
    "about": "Panna cotta is a traditional, easy, and delicious Italian custard. This homemade recipe tastes just like the panna cotta served at Italian restaurants. Serve with warm hot fudge sauce and fresh raspberries on top. It keeps well for several days in the refrigerator.",
    "ingredients": [
      "⅓ cup skim milk",
      "1 (.25 ounce) envelope unflavored gelatin",
      "2 ½ cups heavy cream",
      "½ cup white sugar",
      "1 ½ teaspoons vanilla extract"
    ],
    "recipeInstructions": "Pour milk into a small bowl. Sprinkle gelatin powder over milk and stir until combined. Set aside. \n In a saucepan, stir together heavy cream and sugar. Set over medium heat and bring to a boil, watching carefully as the cream can quickly bubble up. \n Immediately stir in the gelatin mixture, stirring until completely dissolved. Cook and stir for 1 minute. \n Remove the pan from heat and stir in vanilla extract. \n Pour the cream mixture into 6 individual ramekins. Leave to cool, uncovered, for about 20 minutes until no longer warm. \n Once cool, cover with plastic wrap and refrigerate until set, at least 4 hours or preferably overnight."
  }

]
